docs/examples/ship v21/Delete FedEx Tag_Request.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v21="http://fedex.com/ws/ship/v21">
   <soapenv:Header></soapenv:Header>
   <soapenv:Body>
      <v21:DeleteTagRequest>
         <v21:WebAuthenticationDetail>
            <v21:ParentCredential>
               <v21:Key>INPUT YOUR INFORMATION</v21:Key>
               <v21:Password>INPUT YOUR INFORMATION</v21:Password>
            </v21:ParentCredential>
            <v21:UserCredential>
               <v21:Key>INPUT YOUR INFORMATION</v21:Key>
               <v21:Password>INPUT YOUR INFORMATION</v21:Password>
            </v21:UserCredential>
         </v21:WebAuthenticationDetail>
         <v21:ClientDetail>
            <v21:AccountNumber>Input Your Information</v21:AccountNumber>
            <v21:MeterNumber>Input Your Information</v21:MeterNumber>
            <v21:Localization>
               <v21:LanguageCode>EN</v21:LanguageCode>
               <v21:LocaleCode>ES</v21:LocaleCode>
            </v21:Localization>
         </v21:ClientDetail>
         <v21:TransactionDetail>
            <v21:CustomerTransactionId>DeleteTagRequest_v21</v21:CustomerTransactionId>
            <v21:Localization>
               <v21:LanguageCode>EN</v21:LanguageCode>
               <v21:LocaleCode>ES</v21:LocaleCode>
            </v21:Localization>
         </v21:TransactionDetail>
         <v21:Version>
            <v21:ServiceId>ship</v21:ServiceId>
            <v21:Major>21</v21:Major>
            <v21:Intermediate>0</v21:Intermediate>
            <v21:Minor>0</v21:Minor>
         </v21:Version>
         <v21:DispatchLocationId>NQAA</v21:DispatchLocationId>
         <v21:DispatchDate>2016-12-12</v21:DispatchDate>
         <v21:Payment>
            <v21:PaymentType>SENDER</v21:PaymentType>
            <v21:Payor>
               <v21:ResponsibleParty>
                  <v21:AccountNumber>Input Your Information</v21:AccountNumber>
                  <v21:Tins>
                     <v21:TinType>BUSINESS_NATIONAL</v21:TinType>
                     <v21:Number>123456</v21:Number>
                  </v21:Tins>
                  <v21:Contact>
                     <v21:ContactId>123</v21:ContactId>
                  </v21:Contact>
               </v21:ResponsibleParty>
            </v21:Payor>
         </v21:Payment>
         <v21:ConfirmationNumber>Input Your Information</v21:ConfirmationNumber>
      </v21:DeleteTagRequest>
   </soapenv:Body>
</soapenv:Envelope>

Reply:

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ShipmentReply xmlns="http://fedex.com/ws/ship/v21">
         <HighestSeverity>SUCCESS</HighestSeverity>
         <Notifications>
            <Severity>SUCCESS</Severity>
            <Source>ship</Source>
            <Code>0000</Code>
            <Message>Success</Message>
            <LocalizedMessage>Success</LocalizedMessage>
         </Notifications>
         <TransactionDetail>
            <CustomerTransactionId>DeleteTagRequest_v21</CustomerTransactionId>
            <Localization>
               <LanguageCode>EN</LanguageCode>
               <LocaleCode>ES</LocaleCode>
            </Localization>
         </TransactionDetail>
         <Version>
            <ServiceId>ship</ServiceId>
            <Major>21</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
      </ShipmentReply>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>